tap "marsanne/cask"
tap "oven-sh/bun"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Load/unload environment variables based on $PWD
brew "direnv"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GitHub Model Context Protocol server for AI tools
brew "github-mcp-server"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Post-modern modal text editor
brew "helix"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Package management made easy
brew "pixi"
# Fast, disk space efficient package manager
brew "pnpm"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Rust toolchain installer
brew "rustup"
# Non-interactive SSH password auth
brew "sshpass"
# Cross-shell prompt for astronauts
brew "starship"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Command-line tool to interact with Gitea servers
brew "tea"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line interface for Vercel
brew "vercel-cli"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Memory training application
cask "anki"
# AI Coding Agent IDE
cask "antigravity"
# Web browser focusing on privacy
cask "brave-browser"
# Web debugging Proxy application
cask "charles"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Desktop client that supports multiple LLM providers
cask "cherry-studio"
# Another Mihomo GUI
cask "clash-party"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# The Ultimate Homebrew Companion
cask "marsanne/cask/cork"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Write, edit, and chat about your code with AI
cask "cursor"
# Command-line agent for Cursor
cask "cursor-cli"
# Voice and text chat software
cask "discord"
# AI chat assistant
cask "doubao"
# Calendar software
cask "fantastical"
# Project management software
cask "feishu"
# Collaborative team software
cask "figma"
cask "font-3270-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-zed-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Tool for multi-language users
cask "input-source-pro"
# JetBrains tools manager
cask "jetbrains-toolbox"
# File archiver
cask "keka"
# Find shortcuts for any installed application
cask "keyclu"
# Finds, learns and remembers keyboard shortcuts
cask "keycue"
# App to manage software development and track bugs
cask "linear-linear"
# Software for Logitech devices
cask "logi-options+"
# Modern GUI for Redis
cask "medis"
# App to write, plan, collaborate, and get organised
cask "notion"
# Email client integrated with Notion workspace
cask "notion-mail"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cloud storage client
cask "onedrive"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Replacement for Docker Desktop
cask "orbstack"
# Desktop virtualization software
cask "parallels"
# Used to access context-specific actions when text is selected
cask "popclip"
# Collaboration platform for API development
cask "postman"
# Sound, video and lighting control
cask "qlab"
# Control your tools with a few keystrokes
cask "raycast"
# Advanced API Debugging Proxy
cask "reqable"
# File sync and share software
cask "resilio-sync"
# Open source virtual/remote desktop application
cask "rustdesk"
# Screen recorder and editor
cask "screen-studio"
# Collection of apps available by subscription
cask "setapp"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# Rime input method engine
cask "squirrel-app"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Network toolbox
cask "surge"
# App to switch hosts
cask "switchhosts"
# Messaging app with a focus on speed and security
cask "telegram"
# Cloud video conferencing
cask "tencent-meeting"
# SSH client
cask "termius"
# Web browser
cask "thebrowsercompany-dia"
# Charting and social-networking for investment traders
cask "tradingview"
# AI voice dictation that turns speech into polished text
cask "typeless"
# OpenVPN client with AppleScript support
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# All-in-one office service platform in Chinese
cask "wpsoffice-cn"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Bob", id: 1630034110
mas "Budget Flow", id: 1640091876
mas "Capital One Shopping", id: 1477110326
mas "Immersive Translate", id: 6447957425
mas "Infuse", id: 1136220934
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Prime Video", id: 545519333
mas "Save to Raindrop.io", id: 1549370672
mas "SnippetsLab", id: 1006087419
mas "TickTick", id: 966085870
mas "WeChat", id: 836500024
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "asvetliakov.vscode-neovim"
vscode "batisteo.vscode-django"
vscode "be5invis.vscode-custom-css"
vscode "carlos18mz.cyberpunk-2077-rebuild"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "enkia.tokyo-night"
vscode "gaogaotiantian.viztracer-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "jwsandeman.cyberpunk2077-theme"
vscode "kevinrose.vsc-python-indent"
vscode "mathworks.language-matlab"
vscode "max-ss.cyberpunk"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "mhutchie.git-graph"
vscode "microhobby.linuxkerneldev"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "sharashchandradesai.simple-scratch"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "wholroyd.jinja"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
